{"config": [{"config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>@\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 16, 32, 1], "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "output_shape": null}, "class_name": "Lambda"}, {"config": {"input_dtype": "float32", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_1", "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "batch_input_shape": [null, 16, 32, 1], "nb_filter": 2, "border_mode": "valid", "activation": "relu", "W_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "strides": [4, 4], "trainable": true, "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 1, "bias": true, "W_regularizer": null, "b_regularizer": null, "name": "dense_1", "input_dim": 42, "activation": "linear", "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}